/* Задание на урок:

1) Создать переменную numberOfFilms и в неё поместить ответ от пользователя на вопрос:
'Сколько фильмов вы уже посмотрели?'

2) Создать объект personalMovieDB и в него поместить такие свойства:
    - count - сюда передается ответ на первый вопрос
    - movies - в это свойство поместить пустой объект
    - actors - тоже поместить пустой объект
    - genres - сюда поместить пустой массив
    - privat - в это свойство поместить boolean(логическое) значение false

3) Задайте пользователю по два раза вопросы:
    - 'Один из последних просмотренных фильмов?'
    - 'На сколько оцените его?'
Ответы стоит поместить в отдельные переменные
Записать ответы в объект movies в формате: 
    movies: {
        'logan': '8.1'
    }

Проверить, чтобы все работало без ошибок в консоли */

'use strict';

// const numberOfFilms = prompt('Сколько фильмов вы уже посмотрели?');

// console.log(typeof(numbe165rOfFilms));
const personalMovieDB = {
	count: '16',
	movies: {
		spider: prompt('Один из последних просмотренных фильмов?'),
		rate: prompt('На сколько оцените его?')
	},
	actors: {},
	genres: [],
	privat: false
};

console.log(personalMovieDB.movies.spider + personalMovieDB.movies.rate);